# 查询同时存在" 01 "课程和" 02 "课程的情况

select s.*, t.Score_01, t.Score_02
from
    (select SId, sc1.score as 'Score_01', sc2.score as 'Score_02'
    from
        (select * from SC where CId = '01') sc1
            left join
        (select * from SC where CId = '02') sc2
            using (SId)
    where sc2.score is not null) t
    left join Student s using (SId);

# +------+--------+---------------------+------+----------+----------+
# | SId  | Sname  | Sage                | Ssex | Score_01 | Score_02 |
# +------+--------+---------------------+------+----------+----------+
# | 01   | 赵雷    | 1990-01-01 00:00:00 | 男   |     80.0 |     90.0 |
# | 02   | 钱电    | 1990-12-21 00:00:00 | 男   |     70.0 |     60.0 |
# | 03   | 孙风    | 1990-12-20 00:00:00 | 男   |     80.0 |     80.0 |
# | 04   | 李云    | 1990-12-06 00:00:00 | 男   |     50.0 |     30.0 |
# | 05   | 周梅    | 1991-12-01 00:00:00 | 女   |     76.0 |     87.0 |
# +------+--------+---------------------+------+----------+----------+
