# 查询没有学全所有课程的同学的信息

select s.*
from
    Student s left join
    (select sid,count(CId) cnt from SC group by SId) t
    using (SId)
where t.cnt <> (select count(*) as cnt from Course) or t.cnt is null;

# +------+--------+---------------------+------+
# | SId  | Sname  | Sage                | Ssex |
# +------+--------+---------------------+------+
# | 05   | 周梅    | 1991-12-01 00:00:00 | 女   |
# | 06   | 吴兰    | 1992-01-01 00:00:00 | 女   |
# | 07   | 郑竹    | 1989-01-01 00:00:00 | 女   |
# | 09   | 张三    | 2017-12-20 00:00:00 | 女   |
# | 10   | 李四    | 2017-12-25 00:00:00 | 女   |
# | 11   | 李四    | 2012-06-06 00:00:00 | 女   |
# | 12   | 赵六    | 2013-06-13 00:00:00 | 女   |
# | 13   | 孙七    | 2014-06-01 00:00:00 | 女   |
# +------+--------+---------------------+------+
