# 查询至少有一门课与学号为" 01 "的同学所学相同的同学的信息

select *
from Student
         join (
    select distinct SId
    from SC
    where SId <> '01'
      and CId in (
        select CId
        from SC
        where SId = '01')
) t using (SId);

# +------+--------+---------------------+------+
# | SId  | Sname  | Sage                | Ssex |
# +------+--------+---------------------+------+
# | 02   | 钱电    | 1990-12-21 00:00:00 | 男   |
# | 03   | 孙风    | 1990-12-20 00:00:00 | 男   |
# | 04   | 李云    | 1990-12-06 00:00:00 | 男   |
# | 05   | 周梅    | 1991-12-01 00:00:00 | 女   |
# | 06   | 吴兰    | 1992-01-01 00:00:00 | 女   |
# | 07   | 郑竹    | 1989-01-01 00:00:00 | 女   |
# +------+--------+---------------------+------+
