# 检索" 01 "课程分数小于 60，按分数降序排列的学生信息

select *
from Student right join (
    select * from SC
    where CId='01' and score<60.0
) t using(Sid)
order by score desc;

# +------+------+-------+--------+---------------------+------+
# | SId  | CId  | score | Sname  | Sage                | Ssex |
# +------+------+-------+--------+---------------------+------+
# | 04   | 01   |  50.0 | 李云    | 1990-12-06 00:00:00 | 男   |
# | 06   | 01   |  31.0 | 吴兰    | 1992-01-01 00:00:00 | 女   |
# +------+------+-------+--------+---------------------+------+
